import { QnA } from "../types/QnA";

export const QnAs:QnA[] = [
    {id:"canpuse",q:"どのキャンパスを希望しますか？",a:["瀬田","深草","どこでもいい"]},
    {id:"type",q:"体育会系と文化系のどちらに興味がありますか？",a:["体育会系","文化系","どちらも"]},
    {id:"purpose",q:"あなたが部活に求めているのは？",a:["友達作り","新しい体験","思い出作り","挑戦"]},
    {id:"culture_interest",q:"創作に興味がありますか？（音楽やイラストなど）",a:["はい","いいえ"],condition: (answers) => answers["type"] === "体育会系",},
    {id:"sports_interest",q:"どんなスポーツに興味がありますか？（複数回答可）",a:[],condition: (answers) => answers["type"] === "体育会系",},
    {id:"team",q:"チームで協力するのが好き？",a:["とても好き", "まあまあ", "一人でやる方が好き"]},
    {id:"how_much",q:"部活にどれくらい力を入れたい？",a:["全力で頑張りたい", "ほどほどに楽しみたい", "趣味としてゆるくやりたい"]},
    {id:"event",q: "合宿やイベントに参加したい？", a: ["積極的に参加したい", "気が向けば参加", "できれば避けたい"] },
    {id:"frequency",q: "どのくらいの頻度で活動したい？", a: ["週に1～2回", "週3回以上", "月に数回で十分"] }
]
